CSI API ETABS v1
cDiaphragm.GetDiaphragm Method
 Retrieves the specified diaphragm
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDiaphragm(
	string Name,
	ref bool SemiRigid
)
Function GetDiaphragm (
	Name As String,
	ByRef SemiRigid As Boolean
) As Integer
Dim instance As cDiaphragm
Dim Name As String
Dim SemiRigid As Boolean
Dim returnValue As Integer
returnValue = instance.GetDiaphragm(Name,
	SemiRigid)
int GetDiaphragm(
	String^ Name,
	bool% SemiRigid
)
abstract GetDiaphragm :
        Name : string *
        SemiRigid : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing diaphragm
SemiRigid
Type: System.Boolean
 This item is True if the diaphragm is semi-rigid, and False otherwise
Return Value
Type: Int32
 Returns zero if the diaphragm is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SemiRigid As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new diaphragm
    ret = SapModel.Diaphragm.SetDiaphragm("MyDiaphragm1A", SemiRigid:=True)
'get diaphragm
    ret = SapModel.Diaphragm.GetDiaphragm("MyDiaphragm1A", SemiRigid)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDiaphragm Interface
ETABSv1 Namespace